<a href="https://colab.research.google.com/github/krishmethaa28/Machine_Learning_basics/blob/main/trees_test_ipyn.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np
from google.colab import files
uploaded = files.upload()

Saving Tree test dataset.csv to Tree test dataset (1).csv

In [ ]:
import io
df = pd.read_csv(io.StringIO(uploaded['Tree test dataset.csv'].decode('utf-8')))
print(df)

   Company              job     degree  salary more than 100K
0    Tesla       supervisor  bachelors                      1
1   Toyota  sales executive    masters                      1
2   Nissan         engineer  bachelors                      1
3    Tesla         engineer  bachelors                      1
4    Tesla  sales executive  bachelors                      0
5    Tesla  sales executive    masters                      0
6    Tesla         engineer    masters                      1
7    Tesla       supervisor  bachelors                      0
8    Tesla       supervisor    masters                      1
9   Nissan  sales executive    masters                      0
10  Nissan  sales executive  bachelors                      0
11  Nissan         engineer    masters                      1
12  Nissan       supervisor  bachelors                      0
13  Nissan       supervisor    masters                      0
14  Toyota  sales executive  bachelors                      0
15  Toyota       supervisor    masters                      1
16  Toyota       supervisor  bachelors                      1
17  Toyota         engineer  bachelors                      1
18  Toyota         engineer    masters                      1

In [ ]:
inputs = df.drop('salary more than 100K',axis='columns')
inputs

   Company              job     degree
0    Tesla       supervisor  bachelors
1   Toyota  sales executive    masters
2   Nissan         engineer  bachelors
3    Tesla         engineer  bachelors
4    Tesla  sales executive  bachelors
5    Tesla  sales executive    masters
6    Tesla         engineer    masters
7    Tesla       supervisor  bachelors
8    Tesla       supervisor    masters
9   Nissan  sales executive    masters
10  Nissan  sales executive  bachelors
11  Nissan         engineer    masters
12  Nissan       supervisor  bachelors
13  Nissan       supervisor    masters
14  Toyota  sales executive  bachelors
15  Toyota       supervisor    masters
16  Toyota       supervisor  bachelors
17  Toyota         engineer  bachelors
18  Toyota         engineer    masters

In [ ]:
target = df['salary more than 100K']
target

0     1
1     1
2     1
3     1
4     0
5     0
6     1
7     0
8     1
9     0
10    0
11    1
12    0
13    0
14    0
15    1
16    1
17    1
18    1
Name: salary more than 100K, dtype: int64

In [ ]:
from sklearn.preprocessing import LabelEncoder
lbl_company = LabelEncoder()
lbl_job = LabelEncoder()
lbl_degree = LabelEncoder()

In [ ]:
inputs['company_n'] = lbl_company.fit_transform(inputs['Company'])
inputs['job_n'] = lbl_job.fit_transform(inputs['job'])
inputs['degree_n'] = lbl_degree.fit_transform(inputs['degree'])
inputs

   Company              job     degree  company_n  job_n  degree_n
0    Tesla       supervisor  bachelors          1      2         0
1   Toyota  sales executive    masters          2      1         1
2   Nissan         engineer  bachelors          0      0         0
3    Tesla         engineer  bachelors          1      0         0
4    Tesla  sales executive  bachelors          1      1         0
5    Tesla  sales executive    masters          1      1         1
6    Tesla         engineer    masters          1      0         1
7    Tesla       supervisor  bachelors          1      2         0
8    Tesla       supervisor    masters          1      2         1
9   Nissan  sales executive    masters          0      1         1
10  Nissan  sales executive  bachelors          0      1         0
11  Nissan         engineer    masters          0      0         1
12  Nissan       supervisor  bachelors          0      2         0
13  Nissan       supervisor    masters          0      2         1
14  Toyota  sales executive  bachelors          2      1         0
15  Toyota       supervisor    masters          2      2         1
16  Toyota       supervisor  bachelors          2      2         0
17  Toyota         engineer  bachelors          2      0         0
18  Toyota         engineer    masters          2      0         1

In [ ]:
input_nw = inputs.drop(['Company','job','degree'],axis='columns')
input_nw

    company_n  job_n  degree_n
0           1      2         0
1           2      1         1
2           0      0         0
3           1      0         0
4           1      1         0
5           1      1         1
6           1      0         1
7           1      2         0
8           1      2         1
9           0      1         1
10          0      1         0
11          0      0         1
12          0      2         0
13          0      2         1
14          2      1         0
15          2      2         1
16          2      2         0
17          2      0         0
18          2      0         1

In [ ]:
from sklearn import tree
model = tree.DecisionTreeClassifier()
model.fit(input_nw,target)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [ ]:
model.score(input_nw,target)

0.9473684210526315

In [ ]:
model.predict([[2,1,0]])

array([0])